posts/2014-01-05-Montane-Prism.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:nil
#+BEGIN_HTML
Title: Montane Prism Jacket, Trousers and Gilet.
Date: 2014-01-05
Tags: [mountaineering, gear, review]
Category: blog


#+END_HTML


This review is all about a trio of Montane Prisms!

* Prism Jacket.

The Prism jacket has been around for a while and is now at
version 2. The outer is Pertex microlight and it's filled with 40g of
Primaloft. For those of you that don't know Primaloft is best
described as artificial down. Weight for weight down will keep you
warmer than Primaloft. However, Primaloft doesn't clump when it gets
wet unlike down, which then loses most of its insulating
properties. Hence Primaloft is usually more suitable for the British
climate, where it's more often damp and cold unlike the cold dry
weather in an Alpine environment.

So what sort of British conditions is the jacket useful for? It's not
really a full on Scottish winter belay jacket, although you could use
it under a hard shell. It's more of a three season cold/windy
jacket. The Pertex outer is water resistant and will keep out
persistent drizzle, but not a full on downpour. However, if it does
get completely soaked it dries out quickly. Even in summer it's useful
as something to wear at rest stops or at night when camping. My size L
only weighs 445g, so it's not too heavy if you are carrying it in your
rucsack most of the time. It will pack into its own pocket, taking
up very little space in your rucksack.

I am 6ft 2" with a 38" chest. The large size fits me with some room to
spare inside and it's long enough to cover my body. I often find that
medium sized jackets fit me, but aren't long enough. The Prism has a
slight drop tail, so will help stop the small of you back getting cold.

On to the details. The pockets are padded with Primaloft, which makes
them good for hand warming. They are positioned fairly high up, so are
accessible if you are wearing a waist strap or climbing harness. The
cuffs are elasticated keeping out the wind and moisture. There is some
soft material inside the zip flap at the head end. This acts as a
beard guard and even if you don't have a beard will stop your neck and
lips chafing against the material. The full sized hood has a good
volume adjuster, which makes it a comfortable fit with or without a
helmet. I am not always a fan of hoods, often preferring a hat, but I
like this hood.

In use I have found the jacket both warm and very breathable. I have used it
for cycling in temperatures between freezing and about 6C over a
lightweight Merino top. I didn't overheat or find sweat building up
inside the jacket.

* Prism Gilet.
I have got a couple of other gilets. A Marmot Driclime, which is
excellent for warmer weather and a Paramo Torres. I wear the Torres
almost every day at home between Autumn and Summer. It's very and very
robust. However, it's not particularly light (???g) and doesn't pack
down very small. Thus it's good if you actually wear it all day, but
not so good if you are carrying it in your rucksack.

Recently I picked up a Montane Prism gilet. Like the jacket this is
filled with Primaloft and the pockets are also Primaloft filled. Also
like the jacket it packs away in its own pocket. I can see myself
using the gilet a lot from Spring to Autumn worn over a base layer and
with my Rab Vapour Rise Lite jacket. Combined with my Montane Lite
Speed jacket as an outer layer, these three layers should keep me
comfortable in most conditions.

* Prism Trousers.
After a long walk carrying a rucksack when I finally set up camp I
find that if my legs get cold I end up with bad attacks of cramp. I
usually sleep in some thin long johns, to help keep my sleeping bag
clean, but if I am just lounging around inside the tent these aren't
warm enough.

I have been looking around for something warmer than long johns, that
don't weigh much and could also be used to boost my sleeping bag's
insulation in winter. Montane's Prism Pants seemed to a good
choice. Initially, I had reservations. I have got a pair of Montane
Terra trousers, which even in the large size are way too short for my
legs. For some reason Montane seem to make their trousers shorter than
other manufacturers. However,  I needn't have worried as they were
long enough. They pack down into a small stuff sack an my size L weigh
318g. There are short zips at the bottom of the legs and a number of
press stud fastenings,which let you cinch up the bottoms.

There are no pockets or fly zip. However, for my intended use this
isn't a problem. The Rab photon trousers have full length zips, a fly
zip, more Primaloft and have pockets.  There are also reinforced seat,
knees and kick patches. However, they are considerably
heavier at 550g for the L size. Most of the additional features are
only of use if you intend to wear them all day an while the extra
Primaloft makes them warmer, the Prisms should be warm enough for me.
