posts/2014-01-05-Montane-Prism/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Montane Prism | Ian's Blog.</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://ianbarton.co.uk/posts/2014-01-05-Montane-Prism/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Ian Barton.">
<link rel="prev" href="../2014-01-01-Happy_New_Year/" title="Happy New Year" type="text/html">
<link rel="next" href="../2014-02-23-The-Wirral-Way/" title="The Wirral Way" type="text/html">
<meta property="og:site_name" content="Ian's Blog.">
<meta property="og:title" content="Montane Prism">
<meta property="og:url" content="https://ianbarton.co.uk/posts/2014-01-05-Montane-Prism/">
<meta property="og:description" content="This review is all about a trio of Montane Prisms!



Prism Jacket.


The Prism jacket has been around for a while and is now at
version 2. The outer is Pertex microlight and it's filled with 40g of
P">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2014-01-05T17:56:56Z">
<meta property="article:tag" content="review">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://ianbarton.co.uk/">

            <span id="blog-title">Ian's Blog.</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100"></ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
            <div class="row">
<div class="col-md-8 blog-main">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Montane Prism</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Ian Barton.
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2014-01-05T17:56:56Z" itemprop="datePublished" title="2014-01-05 17:56">2014-01-05 17:56</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
This review is all about a trio of Montane Prisms!
</p>

<div id="outline-container-org5512798" class="outline-2">
<h2 id="org5512798">Prism Jacket.</h2>
<div class="outline-text-2" id="text-org5512798">
<p>
The Prism jacket has been around for a while and is now at
version 2. The outer is Pertex microlight and it's filled with 40g of
Primaloft. For those of you that don't know Primaloft is best
described as artificial down. Weight for weight down will keep you
warmer than Primaloft. However, Primaloft doesn't clump when it gets
wet unlike down, which then loses most of its insulating
properties. Hence Primaloft is usually more suitable for the British
climate, where it's more often damp and cold unlike the cold dry
weather in an Alpine environment.
</p>

<p>
So what sort of British conditions is the jacket useful for? It's not
really a full on Scottish winter belay jacket, although you could use
it under a hard shell. It's more of a three season cold/windy
jacket. The Pertex outer is water resistant and will keep out
persistent drizzle, but not a full on downpour. However, if it does
get completely soaked it dries out quickly. Even in summer it's useful
as something to wear at rest stops or at night when camping. My size L
only weighs 445g, so it's not too heavy if you are carrying it in your
rucsack most of the time. It will pack into its own pocket, taking
up very little space in your rucksack.
</p>

<p>
I am 6ft 2" with a 38" chest. The large size fits me with some room to
spare inside and it's long enough to cover my body. I often find that
medium sized jackets fit me, but aren't long enough. The Prism has a
slight drop tail, so will help stop the small of you back getting cold.
</p>

<p>
On to the details. The pockets are padded with Primaloft, which makes
them good for hand warming. They are positioned fairly high up, so are
accessible if you are wearing a waist strap or climbing harness. The
cuffs are elasticated keeping out the wind and moisture. There is some
soft material inside the zip flap at the head end. This acts as a
beard guard and even if you don't have a beard will stop your neck and
lips chafing against the material. The full sized hood has a good
volume adjuster, which makes it a comfortable fit with or without a
helmet. I am not always a fan of hoods, often preferring a hat, but I
like this hood.
</p>

<p>
In use I have found the jacket both warm and very breathable. I have used it
for cycling in temperatures between freezing and about 6C over a
lightweight Merino top. I didn't overheat or find sweat building up
inside the jacket.
</p>
</div>
</div>

<div id="outline-container-org1361d30" class="outline-2">
<h2 id="org1361d30">Prism Gilet.</h2>
<div class="outline-text-2" id="text-org1361d30">
<p>
I have got a couple of other gilets. A Marmot Driclime, which is
excellent for warmer weather and a Paramo Torres. I wear the Torres
almost every day at home between Autumn and Summer. It's very and very
robust. However, it's not particularly light (???g) and doesn't pack
down very small. Thus it's good if you actually wear it all day, but
not so good if you are carrying it in your rucksack.
</p>

<p>
Recently I picked up a Montane Prism gilet. Like the jacket this is
filled with Primaloft and the pockets are also Primaloft filled. Also
like the jacket it packs away in its own pocket. I can see myself
using the gilet a lot from Spring to Autumn worn over a base layer and
with my Rab Vapour Rise Lite jacket. Combined with my Montane Lite
Speed jacket as an outer layer, these three layers should keep me
comfortable in most conditions.
</p>
</div>
</div>

<div id="outline-container-orgbae0e43" class="outline-2">
<h2 id="orgbae0e43">Prism Trousers.</h2>
<div class="outline-text-2" id="text-orgbae0e43">
<p>
After a long walk carrying a rucksack when I finally set up camp I
find that if my legs get cold I end up with bad attacks of cramp. I
usually sleep in some thin long johns, to help keep my sleeping bag
clean, but if I am just lounging around inside the tent these aren't
warm enough.
</p>

<p>
I have been looking around for something warmer than long johns, that
don't weigh much and could also be used to boost my sleeping bag's
insulation in winter. Montane's Prism Pants seemed to a good
choice. Initially, I had reservations. I have got a pair of Montane
Terra trousers, which even in the large size are way too short for my
legs. For some reason Montane seem to make their trousers shorter than
other manufacturers. However,  I needn't have worried as they were
long enough. They pack down into a small stuff sack an my size L weigh
318g. There are short zips at the bottom of the legs and a number of
press stud fastenings,which let you cinch up the bottoms.
</p>

<p>
There are no pockets or fly zip. However, for my intended use this
isn't a problem. The Rab photon trousers have full length zips, a fly
zip, more Primaloft and have pockets.  There are also reinforced seat,
knees and kick patches. However, they are considerably
heavier at 550g for the L size. Most of the additional features are
only of use if you intend to wear them all day an while the extra
Primaloft makes them warmer, the Prisms should be warm enough for me.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/review/" rel="tag">review</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../2014-01-01-Happy_New_Year/" rel="prev" title="Happy New Year">Previous post</a>
            </li>
            <li class="next">
                <a href="../2014-02-23-The-Wirral-Way/" rel="next" title="The Wirral Way">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content-->
</div>
<aside class="col-md-4 blog-sidebar"><div class="sidebar-module sidebar-module-inset">
<h4>Search </h4>
<!-- Google custom search -->
<form method="get" action="https://www.google.com/search" class="navbar-form navbar-right" role="search">
<div class="form-group">
<input type="text" name="q" class="form-control" placeholder="Search">
</div>
<button type="submit" class="btn btn-primary">
	<span class="glyphicon glyphicon-search"></span>
</button>
<input type="hidden" name="sitesearch" value="%s">
</form>
<!-- End of custom search -->


  <h4><a href="../../pages/about/index.html">About.</a></h4>

</div>
<div class="sidebar-module">


  <h4>Links</h4>
  <ol class="list-unstyled">
<li><a href="../../categories/index.html">Tags</a></li>
    <li><a href="../../archive.html">Archive</a></li>
    <li><a href="http://getbootstrap.com/examples/blog/">Bootstrap Blog Theme</a></li>
    <li><a href="https://getnikola.com/">Nikola</a></li>
  </ol>
</div>
</aside>
</div>

        <footer id="footer">
            Contents © 2020         <a href="mailto:ian@ianbarton.co.uk">Ian Barton.</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
